test/multiphase/multiphaseEulerFoam/populationBalance/isothermalGrowth/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     multiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  9;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

functions
{
    #includeFunc residuals
    (
        p_rgh,
        f3.air1.bubbles,
        f9.air2.bubbles,
        f15.air3.bubbles
    )
    #includeFunc graphCell
    (
        funcName=graph,
        start=(0.05 0 0.05),
        end=(0.05 1.0 0.05),
        axis=y,
        d.bubbles,
        p,
        alpha.air1,
        alpha.air2,
        alpha.air3,
        alpha.bubbles
    )
    #includeFunc cellZoneAverage
    #includeFunc writeObjects(d.air1)
    #includeFunc writeObjects(d.air2)
    #includeFunc writeObjects(d.air3)
}

// ************************************************************************* //
